/// *********************************************************************************************************************
/// 
/// @file       TextureManager.cs
/// @desc       テクスチャを管理するクラスファイルです
/// @date       2015.07.20
/// @copyright  t.yossy
/// 
/// *********************************************************************************************************************
using System;
using UnityEngine;
using System.Collections;

/// ============================================================================================
/// @namespace RPG
/// @desc      RPG名前空間
/// ============================================================================================
namespace RPG
{

    /// ============================================================================================
    /// @namespace Manager 
    /// @desc      マネージャー名前空間
    /// ============================================================================================
    namespace Manager
    {
        /// <summary>
        /// テクスチャマネージャークラス
        /// </summary>
        public sealed class TextureManager
        {
            /// <summary>
            /// このクラスのインスタンスを取得します
            /// </summary>
            public static TextureManager Instance
            {
                get { return sInstance; }
            }

            private static TextureManager sInstance = null;
        }
    }
}

/// *********************************************************************************************************************
/// EOF 

