/// *********************************************************************************************************************
/// 
/// @file       ScreenDescription.cs
/// @desc       スクリーンの詳細設定を記述するクラスファイルです
/// @date       2015.07.20
/// @copyright  t.yossy
/// 
/// *********************************************************************************************************************
using System;
using UnityEngine;
using System.Collections;

/// ============================================================================================
/// @namespace RPG
/// @desc      RPG名前空間
/// ============================================================================================
namespace RPG
{

    /// ============================================================================================
    /// @namespace Screen 
    /// @desc      Screen名前空間
    /// ============================================================================================
    namespace Screen
    {
        /// <summary>
        /// スクリーン詳細設定クラス
        /// </summary>
        public class ScreenDescription : MonoBehaviour
        {
            /// <summary>
            /// Unity側から起動される初期化時のメソッドです
            /// </summary>
            void Start()
            {

            }

            /// <summary>
            /// Unity側から毎フレーム呼び出されるメソッドです
            /// </summary>
            void Update()
            {

            }
            
            /// <summary>
            /// このDescriptionの名前です
            /// </summary>
            public string Name;

            /// <summary>
            /// スクリーン幅を表します
            /// </summary>
            public int ResolutionWidth;

            /// <summary>
            /// スクリーン高を表します
            /// </summary>
            public int ResolutionHeight;
        }
    }
}

/// *********************************************************************************************************************
/// EOF 

