/// *********************************************************************************************************************
/// 
/// @file       Unit.cs
/// @desc       GameObjectを管理するユニットクラスファイルです
/// @date       2015.07.20
/// @copyright  t.yossy
/// 
/// *********************************************************************************************************************
using System;
using UnityEngine;
using System.Collections;

/// ============================================================================================
/// @namespace RPG
/// @desc      RPG名前空間
/// ============================================================================================
namespace RPG
{
    /// <summary>
    /// ユニット基底クラス
    /// </summary>
    public class Unit : MonoBehaviour
    {
        /// <summary>
        /// 初期化
        /// </summary>
        void Start()
        {

        }

        /// <summary>
        /// 更新
        /// </summary>
        void Update()
        {

        }
    }
}